Documents/Лео_РаспределениеТрудаАУП/Лео_РаспределениеТрудаАУП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_РаспределениеТрудаАУП</name>
  <attributes>
    <name>ФОТПрямой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФОТАУП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщепроизводственныеРасходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логистика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоммунальныеУслуги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабАУП</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Выпуск</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяСтоимостьТрудаНаЕд</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяСтоимостьТрудаНаОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФОТПрямойФактВыплата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФОТАУПФактВыплата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоТрудозатратыПолные</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактСтоимостьТрудозатратПолныеНаЕд</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Таб</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МатериальнаяСебестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Трудозатраты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщепроизводственныеРасходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Логистика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоммунальныеУслуги</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Амортизация</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроизводственнаяСебестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроизводственнаяСебестоимостьЕд</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AccumulationRegisters/Лео_ФакТрудозатратОПЗС_Свод/Лео_ФакТрудозатратОПЗС_Свод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Лео_ФакТрудозатратОПЗС_Свод</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПланЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоФактЧеловек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОПзС_ПФ</name>
    <type>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактТрудозатрат</name>
    <type>
      <types>DocumentRef.Лео_ФактТрудозатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьЗамечания</name>
    <type>
      <types>CatalogRef.Лео_ОПЗС_Замечания</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьЗамечанияВыполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемПартииПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемПартииФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемВыпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_СводПодсветка</name>
    <type>
      <types>CatalogRef.Лео_СводПодсветкаТруд</types>
    </type>
  </attributes>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПродукцияСерия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Лео_ДолжностиПереработчиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Техоперация</name>
    <type>
      <types>CatalogRef.ТехнологическиеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипТехоперации</name>
    <type>
      <types>CatalogRef.Лео_ТипТехОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОборудования</name>
    <type>
      <types>CatalogRef.Лео_оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AccumulationRegisters/Лео_УчетЗатратОПЗС_Свод/Лео_УчетЗатратОПЗС_Свод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Лео_УчетЗатратОПЗС_Свод</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПФ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ПФСерия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПФОПЗС</name>
    <type>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемВыпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпецификацияПлан</name>
    <type>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпецификацияФакт</name>
    <type>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьЗамечания</name>
    <type>
      <types>CatalogRef.Лео_ОПЗС_Замечания</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьЗамечанияВыполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОПЗСКомментарий</name>
    <type>
      <types>CatalogRef.Лео_ПланФактСводКомментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_СводПодсветка</name>
    <type>
      <types>CatalogRef.Лео_СводПодсветка</types>
    </type>
  </attributes>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПродукцияСерия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Documents/Лео_РаспределениеТрудаАУП/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	// Вставить содержимое обработчика.
	
	
	Объект.ТабАУП.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Лео_ФакТрудозатратОПЗС_Свод.Продукция,
	//|	Лео_ФакТрудозатратОПЗС_Свод.ПродукцияСерия,
	//|	СУММА(ВЫБОР
	//|			КОГДА Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт > 0
	//|				ТОГДА Лео_ФакТрудозатратОПЗС_Свод.СуммаФакт / Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК ФактТрудозатратНаЕд,
	//|	Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт
	//|ПОМЕСТИТЬ ТЗ
	//|ИЗ
	//|	РегистрНакопления.Лео_ФакТрудозатратОПЗС_Свод КАК Лео_ФакТрудозатратОПЗС_Свод
	//|ГДЕ
	//|	Лео_ФакТрудозатратОПЗС_Свод.Период МЕЖДУ &ДатаНач И &ДатаКон
	//|	И Лео_ФакТрудозатратОПЗС_Свод.Продукция.ВидНоменклатуры = &ВидНоменклатуры
	//|	И Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт > 0
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Лео_ФакТрудозатратОПЗС_Свод.Продукция,
	//|	Лео_ФакТрудозатратОПЗС_Свод.ПродукцияСерия,
	//|	Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТЗ.Продукция КАК Номенклатура,
	//|	ТЗ.ПродукцияСерия КАК СерияНоменклатуры,
	//|	СУММА(ТЗ.ОбъемПартииФакт) КАК Выпуск,
	//|	СУММА(ТЗ.ФактТрудозатратНаЕд * ТЗ.ОбъемПартииФакт) КАК Поле1,
	//|	СУММА(ТЗ.ФактТрудозатратНаЕд * ТЗ.ОбъемПартииФакт) / СУММА(ТЗ.ОбъемПартииФакт) КАК ФактическаяСтоимостьТрудаНаЕд
	//|ИЗ
	//|	ТЗ КАК ТЗ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТЗ.Продукция,
	//|	ТЗ.ПродукцияСерия"; 
	
	
	
	"ВЫБРАТЬ
	|	Лео_ФакТрудозатратОПЗС_Свод.ПродукцияСерия,
	|	Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт КАК ОбъемПартииФакт
	|ПОМЕСТИТЬ ТЗоб
	|ИЗ
	|	РегистрНакопления.Лео_ФакТрудозатратОПЗС_Свод КАК Лео_ФакТрудозатратОПЗС_Свод
	|ГДЕ
	|	Лео_ФакТрудозатратОПЗС_Свод.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И Лео_ФакТрудозатратОПЗС_Свод.Продукция.ВидНоменклатуры = &ВидНоменклатуры
	|	И Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Лео_ФакТрудозатратОПЗС_Свод.Регистратор,
	|	Лео_ФакТрудозатратОПЗС_Свод.Продукция,
	|	Лео_ФакТрудозатратОПЗС_Свод.ПродукцияСерия,
	|	Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗоб.ПродукцияСерия,
	|	СУММА(ТЗоб.ОбъемПартииФакт) КАК ОбъемПартииФакт
	|ПОМЕСТИТЬ ТЗоб_1
	|ИЗ
	|	ТЗоб КАК ТЗоб
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗоб.ПродукцияСерия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лео_ФакТрудозатратОПЗС_Свод.Продукция,
	|	Лео_ФакТрудозатратОПЗС_Свод.ПродукцияСерия,
	|	СУММА(ВЫБОР
	|			КОГДА Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт > 0
	|				ТОГДА Лео_ФакТрудозатратОПЗС_Свод.СуммаФакт / Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ФактТрудозатратНаЕд,
	|	Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	РегистрНакопления.Лео_ФакТрудозатратОПЗС_Свод КАК Лео_ФакТрудозатратОПЗС_Свод
	|ГДЕ
	|	Лео_ФакТрудозатратОПЗС_Свод.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И Лео_ФакТрудозатратОПЗС_Свод.Продукция.ВидНоменклатуры = &ВидНоменклатуры
	|	И Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Лео_ФакТрудозатратОПЗС_Свод.Продукция,
	|	Лео_ФакТрудозатратОПЗС_Свод.ПродукцияСерия,
	|	Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.Продукция КАК Номенклатура,
	|	ТЗ.ПродукцияСерия КАК СерияНоменклатуры,
	|	СУММА(ТЗ.ОбъемПартииФакт) КАК ОбъемПартииФакт,
	|	СУММА(ТЗ.ФактТрудозатратНаЕд * ТЗ.ОбъемПартииФакт) КАК Поле1,
	|	СУММА(ТЗ.ФактТрудозатратНаЕд * ТЗ.ОбъемПартииФакт) / СУММА(ТЗ.ОбъемПартииФакт) КАК ФактическаяСтоимостьТрудаНаЕд,
	|	МАКСИМУМ(ТЗоб_1.ОбъемПартииФакт) КАК Выпуск
	|ИЗ
	|	ТЗ КАК ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗоб_1 КАК ТЗоб_1
	|		ПО ТЗ.ПродукцияСерия = ТЗоб_1.ПродукцияСерия
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗ.Продукция,
	|	ТЗ.ПродукцияСерия";	
	
	
	
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.ВидыНоменклатуры.НайтиПоКоду("000000008"));//Конечная продукция
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Объект.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			стр = Объект.ТабАУП.Добавить();
			ЗаполнитьЗначенияСвойств(стр,ВыборкаДетальныеЗаписи);
			стр.ФактическаяСтоимостьТрудаНаОбъем = стр.Выпуск * стр.ФактическаяСтоимостьТрудаНаЕд;
			
		КонецЦикла;
		
		
		ЗаполнитьАУП();
		
	КонецЕсли;
	
	Объект.ТабАУП.Сортировать("Номенклатура");
	
КонецПроцедуры     

Процедура ЗаполнитьАУП()
	
	_ФактическаяСтоимостьТрудаНаОбъем = 0; 
	_ИтогоТрудозатратыПолные = 0; 
	_ФОТАУПФактВыплата = 0;
	Для каждого стр из Объект.ТабАУП цикл
		_ФактическаяСтоимостьТрудаНаОбъем = _ФактическаяСтоимостьТрудаНаОбъем + стр.ФактическаяСтоимостьТрудаНаОбъем; 
	КонецЦикла;
	
	Для каждого стр из Объект.ТабАУП цикл
		стр.ФОТПрямойФактВыплата = стр.ФактическаяСтоимостьТрудаНаОбъем/_ФактическаяСтоимостьТрудаНаОбъем * Объект.ФОТПрямой; 	
		стр.ФОТАУПФактВыплата = стр.ФактическаяСтоимостьТрудаНаОбъем/_ФактическаяСтоимостьТрудаНаОбъем * Объект.ФОТАУП; 	
		стр.ИтогоТрудозатратыПолные = стр.ФОТПрямойФактВыплата + стр.ФОТАУПФактВыплата;	
		стр.ФактСтоимостьТрудозатратПолныеНаЕд = стр.ИтогоТрудозатратыПолные/стр.Выпуск;	
		_ИтогоТрудозатратыПолные = _ИтогоТрудозатратыПолные + стр.ИтогоТрудозатратыПолные;
		_ФОТАУПФактВыплата = _ФОТАУПФактВыплата + стр.ФОТАУПФактВыплата;
	КонецЦикла;
	
	//Объект.Коэффициент = _ИтогоТрудозатратыПолные/_ФактическаяСтоимостьТрудаНаОбъем;
	Объект.Коэффициент = (Объект.ФОТПрямой + _ФОТАУПФактВыплата)/Объект.ФОТПрямой;
	        
	
КонецПроцедуры	


Процедура ЗаполнитьОсновные()
	
	_МатериальнаяСебестоимость = 0; 
	_Трудозатраты = 0;
	Для каждого стр из Объект.Таб цикл
		_МатериальнаяСебестоимость = _МатериальнаяСебестоимость + стр.МатериальнаяСебестоимость; 
		_Трудозатраты = _Трудозатраты + стр.Трудозатраты; 
	КонецЦикла;
	
	Для каждого стр из Объект.Таб цикл
		стр.ОбщепроизводственныеРасходы = Объект.ОбщепроизводственныеРасходы/(_МатериальнаяСебестоимость + _Трудозатраты)*(стр.МатериальнаяСебестоимость +  стр.Трудозатраты); 	
		стр.Логистика = Объект.Логистика/(_МатериальнаяСебестоимость + _Трудозатраты)*(стр.МатериальнаяСебестоимость +  стр.Трудозатраты); 	
		стр.КоммунальныеУслуги = Объект.КоммунальныеУслуги/(_МатериальнаяСебестоимость + _Трудозатраты)*(стр.МатериальнаяСебестоимость +  стр.Трудозатраты); 	
		стр.Амортизация = Объект.Амортизация/(_МатериальнаяСебестоимость + _Трудозатраты)*(стр.МатериальнаяСебестоимость +  стр.Трудозатраты); 	
		стр.ПроизводственнаяСебестоимость = стр.МатериальнаяСебестоимость+стр.Трудозатраты+ стр.ОбщепроизводственныеРасходы+ стр.Логистика+ стр.КоммунальныеУслуги+ стр.Амортизация; 
		стр.ПроизводственнаяСебестоимостьЕд = стр.ПроизводственнаяСебестоимость / стр.Количество;
	КонецЦикла;
	
	
КонецПроцедуры


&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Вставить содержимое обработчика 
	
	Если Объект.Ответственный.Пустая() Тогда
		Объект.Ответственный = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФОТПрямойПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ЗаполнитьАУП();
КонецПроцедуры

&НаКлиенте
Процедура ФОТАУППриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ЗаполнитьАУП();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОсновнаяНаСервере()
	// Вставить содержимое обработчика. 
	
	Объект.Таб.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Лео_УчетЗатратОПЗС_Свод.Продукция,
	//|	Лео_УчетЗатратОПЗС_Свод.ПродукцияСерия,
	//|	Лео_УчетЗатратОПЗС_Свод.ОбъемВыпуска,
	//|	СУММА(Лео_УчетЗатратОПЗС_Свод.КоличествоФакт / Лео_УчетЗатратОПЗС_Свод.ОбъемВыпуска * Лео_УчетЗатратОПЗС_Свод.ЦенаФакт) КАК СуммаСИМсПотерямиФактЕд
	//|ПОМЕСТИТЬ ТЗ
	//|ИЗ
	//|	РегистрНакопления.Лео_УчетЗатратОПЗС_Свод КАК Лео_УчетЗатратОПЗС_Свод
	//|ГДЕ
	//|	Лео_УчетЗатратОПЗС_Свод.Период МЕЖДУ &ДатаНач И &ДатаКон
	////|	И Лео_УчетЗатратОПЗС_Свод.Продукция.ВидНоменклатуры = &ВидНоменклатуры
	//|	И Лео_УчетЗатратОПЗС_Свод.Продукция В (&Продукция)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Лео_УчетЗатратОПЗС_Свод.Продукция,
	//|	Лео_УчетЗатратОПЗС_Свод.ПродукцияСерия,
	//|	Лео_УчетЗатратОПЗС_Свод.ОбъемВыпуска
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТЗ.Продукция КАК Номенклатура,
	//|	ТЗ.ПродукцияСерия КАК СерияНоменклатуры,
	//|	СУММА(ТЗ.ОбъемВыпуска) КАК Количество,
	//|	СУММА(ТЗ.СуммаСИМсПотерямиФактЕд * ТЗ.ОбъемВыпуска) / СУММА(ТЗ.ОбъемВыпуска) КАК МатериальнаяСтоимостьНаЕд,
	//|	СУММА(ТЗ.СуммаСИМсПотерямиФактЕд * ТЗ.ОбъемВыпуска) / СУММА(ТЗ.ОбъемВыпуска) * СУММА(ТЗ.ОбъемВыпуска) КАК МатериальнаяСебестоимость
	//|ИЗ
	//|	ТЗ КАК ТЗ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТЗ.Продукция,
	//|	ТЗ.ПродукцияСерия"; 
	
	
	"ВЫБРАТЬ
	|	Лео_ФакТрудозатратОПЗС_Свод.ПродукцияСерия,
	|	Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт КАК ОбъемПартииФакт
	|ПОМЕСТИТЬ ТЗоб
	|ИЗ
	|	РегистрНакопления.Лео_ФакТрудозатратОПЗС_Свод КАК Лео_ФакТрудозатратОПЗС_Свод
	|ГДЕ
	|	Лео_ФакТрудозатратОПЗС_Свод.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И Лео_ФакТрудозатратОПЗС_Свод.Продукция В(&Продукция)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лео_ФакТрудозатратОПЗС_Свод.Регистратор,
	|	Лео_ФакТрудозатратОПЗС_Свод.Продукция,
	|	Лео_ФакТрудозатратОПЗС_Свод.ПродукцияСерия,
	|	Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗоб.ПродукцияСерия,
	|	СУММА(ТЗоб.ОбъемПартииФакт) КАК ОбъемПартииФакт
	|ПОМЕСТИТЬ ТЗоб_1
	|ИЗ
	|	ТЗоб КАК ТЗоб
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗоб.ПродукцияСерия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лео_УчетЗатратОПЗС_Свод.Продукция,
	|	Лео_УчетЗатратОПЗС_Свод.ПродукцияСерия,
	|	Лео_УчетЗатратОПЗС_Свод.ОбъемВыпуска,
	|	СУММА(Лео_УчетЗатратОПЗС_Свод.КоличествоФакт / Лео_УчетЗатратОПЗС_Свод.ОбъемВыпуска * Лео_УчетЗатратОПЗС_Свод.ЦенаФакт) КАК СуммаСИМсПотерямиФактЕд
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	РегистрНакопления.Лео_УчетЗатратОПЗС_Свод КАК Лео_УчетЗатратОПЗС_Свод
	|ГДЕ
	|	Лео_УчетЗатратОПЗС_Свод.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И Лео_УчетЗатратОПЗС_Свод.Продукция В(&Продукция)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лео_УчетЗатратОПЗС_Свод.Продукция,
	|	Лео_УчетЗатратОПЗС_Свод.ПродукцияСерия,
	|	Лео_УчетЗатратОПЗС_Свод.ОбъемВыпуска
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.Продукция КАК Номенклатура,
	|	ТЗ.ПродукцияСерия КАК СерияНоменклатуры,
	|	СУММА(ТЗ.ОбъемВыпуска) КАК Количество_1,
	|	СУММА(ТЗ.СуммаСИМсПотерямиФактЕд * ТЗ.ОбъемВыпуска) / СУММА(ТЗ.ОбъемВыпуска) КАК МатериальнаяСтоимостьНаЕд,
	|	СУММА(ТЗ.СуммаСИМсПотерямиФактЕд * ТЗ.ОбъемВыпуска) / СУММА(ТЗ.ОбъемВыпуска) * СУММА(ТЗ.ОбъемВыпуска) КАК МатериальнаяСебестоимость,
	|	МАКСИМУМ(ТЗоб_1.ОбъемПартииФакт) КАК Количество
	|ИЗ
	|	ТЗ КАК ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗоб_1 КАК ТЗоб_1
	|		ПО ТЗ.ПродукцияСерия = ТЗоб_1.ПродукцияСерия
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗ.Продукция,
	|	ТЗ.ПродукцияСерия";
	
	
	
	
	//Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.ВидыНоменклатуры.НайтиПоКоду("000000008"));//Конечная продукция
	Запрос.УстановитьПараметр("Продукция",РеквизитФормыВЗначение("Объект").ТабАУП.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Объект.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			стр = Объект.Таб.Добавить();
			ЗаполнитьЗначенияСвойств(стр,ВыборкаДетальныеЗаписи);  
						
		КонецЦикла;
		
		ЗаполнитьФОТданными();
		
		//ЗаполнитьОПР_Логистика();
		
	КонецЕсли;
	
	ЗаполнитьОсновные();
	
	Объект.Таб.Сортировать("Номенклатура");
	
КонецПроцедуры 


Процедура ЗаполнитьФОТданными()

	Для каждого стр из Объект.Таб цикл
		
		
		мПоиска = Объект.ТабАУП.НайтиСтроки(Новый Структура("Номенклатура,СерияНоменклатуры",стр.Номенклатура,стр.СерияНоменклатуры));
		Если мПоиска.Количество() > 0 тогда
			
			//стр.Трудозатраты = мПоиска[0].ФактическаяСтоимостьТрудаНаОбъем;
			стр.Трудозатраты = мПоиска[0].ИтогоТрудозатратыПолные;
					
		Конецесли;
		
		
	КонецЦикла;
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОсновная(Команда)
	ЗаполнитьОсновнаяНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбщепроизводственныеРасходыПриИзменении(Элемент)
	ЗаполнитьОсновные();
КонецПроцедуры

&НаКлиенте
Процедура ЛогистикаПриИзменении(Элемент)
	ЗаполнитьОсновные();
КонецПроцедуры

&НаКлиенте
Процедура КоммунальныеУслугиПриИзменении(Элемент)
	ЗаполнитьОсновные();
КонецПроцедуры

&НаКлиенте
Процедура АмортизацияПриИзменении(Элемент)
	ЗаполнитьОсновные();
КонецПроцедуры
